## [terraform-project](https://my-first-env.app.spacelift.io/stack/terraform-project/run/01H11YYKJ3MQN50VV45877PVKX) plan logs

<details>
<summary>Click here to expand</summary>

```
[01H11M9DQZY490YXS04A7N6QV1] Planning changes with 0 custom hooks...
aws_key_pair.jubran_auth: Refreshing state... [id=jubran_key]
aws_vpc.dev_vpc: Refreshing state... [id=vpc-0fd7e7a45c412bafd]
data.aws_ami.dev_server_ami: Reading...
data.aws_ami.dev_server_ami: Read complete after 0s [id=ami-0dc7b36a7148acf6f]
aws_route_table.dev_public_rt: Refreshing state... [id=rtb-09c9393a4267d0a33]
aws_subnet.dev_public_subnet: Refreshing state... [id=subnet-02471e1254a7152b4]
aws_security_group.dev_sg: Refreshing state... [id=sg-0dcc43d662cf71c98]
aws_internet_gateway.dev_internet_gateway: Refreshing state... [id=igw-0b9a8d766d6ef8a46]
aws_route_table_association.dev_public_assoc: Refreshing state... [id=rtbassoc-046e691066c352717]
aws_instance.jubran_dev_node: Refreshing state... [id=i-0e809edb2f27c8bdd]
aws_route.default_route: Refreshing state... [id=r-rtb-09c9393a4267d0a331080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.jubran_dev_node must be replaced
-/+ resource "aws_instance" "jubran_dev_node" {
      ~ ami                                  = "ami-091b1c4aa02ba6400" -> "ami-0dc7b36a7148acf6f" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:379163426062:instance/i-0e809edb2f27c8bdd" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0e809edb2f27c8bdd" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ instance_type                        = "t2.micro" -> "t3.micro"
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0242e6498de9b84b9" -> (known after apply)
      ~ private_dns                          = "ip-10-0-43-147.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.43.147" -> (known after apply)
      ~ public_dns                           = "ec2-35-175-254-54.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "35.175.254.54" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - tags                                 = {} -> null
      ~ tags_all                             = {} -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0f14083bbdc3785b6" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ dev_ip = "35.175.254.54" -> (known after apply)
[01H11M9DQZY490YXS04A7N6QV1] Changes are GO
[01H11M9DQZY490YXS04A7N6QV1] Uploading the list of managed resources...
[01H11M9DQZY490YXS04A7N6QV1] Please be aware that Run changes calculation includes Terraform output changes.
[01H11M9DQZY490YXS04A7N6QV1] Resource list upload is GO
[01H11M9DQZY490YXS04A7N6QV1] Generating JSON representation of the plan...
[01H11M9DQZY490YXS04A7N6QV1] JSON representation is GO
[01H11M9DQZY490YXS04A7N6QV1] Loading custom plan policy inputs...
[01H11M9DQZY490YXS04A7N6QV1] 0 custom plan policy inputs found
[01H11M9DQZY490YXS04A7N6QV1] Evaluated 1 plan policy
[01H11M9DQZY490YXS04A7N6QV1] Denied by policy: "aws_instance.jubran_dev_node" Denied due to instance type, please choose t2.micro
[01H11M9DQZY490YXS04A7N6QV1] Failing the run as per plan policy
```

</details>